tap "adoptopenjdk/openjdk"
tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "parera10/csshx"
tap "puppetlabs/puppet"
tap "railwaycat/emacsmacport"
tap "srkomodo/tap"
tap "twlz0ne/ccls"
tap "vitorgalvao/tiny-scripts"
cask "xquartz"
brew "sqlite"
brew "python"
brew "ansible-lint"
brew "aria2"
brew "asciidoc"
brew "asciinema"
brew "aspell"
brew "dbus", restart_service: true
brew "bash"
brew "bash-completion"
brew "brew-cask-completion"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "cscope"
brew "ctags"
brew "curl"
brew "cppman"
brew "direnv"
brew "docker"
brew "dos2unix"
brew "editorconfig"
brew "exa"
brew "fcitx-remote-for-osx"
brew "fd"
brew "figlet"
brew "fish"
brew "fontforge"
brew "freerdp"
brew "fzf"
brew "gawk"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-flow"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-typist"
brew "gnupg"
brew "go"
brew "goenv"
brew "graphviz"
brew "glslang"
brew "highlight"
brew "hr"
brew "htop"
brew "httpie"
brew "hub"
brew "hugo"
brew "hyperfine"
brew "imagemagick"
brew "ipcalc"
brew "iproute2mac"
brew "ipython"
brew "ispell"
brew "isync"
brew "jq"
brew "languagetool"
brew "lftp"
brew "llvm"
brew "lsd"
brew "make"
brew "markdown"
brew "mas"
brew "mercurial"
brew "mtr"
brew "mu"
brew "mydumper"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "nethack"
brew "netperf"
brew "nmap"
brew "nnn"
brew "node"
brew "openconnect"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "tree"
brew "pass"
brew "percol"
brew "percona-toolkit"
brew "perl"
brew "plantuml"
brew "pyenv"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "rust-analyzer"
brew "rustc-completion"
brew "screen"
brew "sdcv"
brew "shellcheck"
brew "sift"
brew "smartmontools"
brew "socat"
brew "stow"
brew "tdlib"
brew "teensy_loader_cli"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "trash"
brew "ucg"
brew "unar"
brew "unzip"
brew "util-linux"
brew "vim", link: false
brew "wakatime-cli"
brew "watchman"
brew "wget"
brew "yadm"
brew "yasm"
brew "you-get"
brew "youtube-dl"
brew "parera10/csshx/csshx"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-dbus", "with-rsvg"]
brew "twlz0ne/ccls/ccls"
brew "vmtouch"
cask "alacritty"
cask "alfred"
cask "apppolice"
cask "android-platform-tools"
cask "ansible-dk"
cask "copyq"
cask "dash"
cask "discord"
cask "emacsclient"
cask "firefox"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-noto-emoji"
cask "font-noto-sans-cjk-sc"
cask "font-sarasa-gothic"
cask "font-symbola"
cask "font-recursive"
cask "font-recursive-code"
cask "font-victor-mono"
cask "gns3"
cask "google-chrome"
cask "google-earth-pro"
cask "gpg-suite"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "keycastr"
cask "kindle"
cask "kitty"
cask "lyricsx"
cask "macvim"
cask "manico"
cask "minecraft"
cask "mysqlworkbench"
cask "mtmr"
cask "neteasemusic"
cask "opera"
cask "pencil"
cask "pdk"
cask "puppet-agent"
cask "provisionql"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "qsync-client"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklook-pat"
cask "quicklookapk"
cask "quicklookase"
cask "qutebrowser"
cask "ricoh-ps-printers-vol4-exp-driver"
cask "sequel-pro"
cask "shadowsocksx-ng"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "squirrel"
cask "steam"
cask "teensy"
cask "telegram"
cask "vscodium"
cask "webpquicklook"
cask "wechat"
cask "wireshark"
cask "xmind"
cask "yed"
cask "zoomus"
mas "iPack", id: 433386677
mas "iThoughtsX", id: 720669838
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "PopClip", id: 445189367
mas "Xcode", id: 497799835
mas "WireGuard", id: 1451685025
